In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model

In [3]:
df = pd.read_csv('homeprices2.csv')
df.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

#### Handling NA values

In [6]:
import math
median_val= math.floor(df.bedrooms.median())

### Data preprocessing (data cleaning)

In [7]:
#Fill the null values: using (fillna)
df.bedrooms = df.bedrooms.fillna(median_val)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [67]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

### Train the model

In [8]:
val = linear_model.LinearRegression()
val.fit(df[['area','bedrooms','age']],df.price)

LinearRegression()

In [9]:
val.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [63]:
val.intercept_

221323.00186540425

In [77]:
val.predict([[2200,3,20]])

array([473392.65619926])

In [78]:
112*2200+23388*3+-3231*20+221323

473267

### Predict the price

In [13]:
pred=val.predict([[2500,4,5]])
print(int(pred),'$')

578876 $

###  Predicted price: 578876  in USD